sample_for_test.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns2="urn:com:expd:customs:us:webservices" xmlns:ns3="urn:com:expd:customs:us:servicewrappers" id="015-014-0005">
                <ns0:Header>
                    <ns1:Security>
                        <ns1:UsernameToken ns2:Id="UsernameToken-1">
                            <ns1:Username>qaa-harmschd</ns1:Username>
                            <ns1:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">qainternal!</ns1:Password>
                        </ns1:UsernameToken>
                    </ns1:Security>
                </ns0:Header>
                <ns0:Body>
                    <ns3:load7501FromCatair>
                        <ns3:in>
                            <ns2:actionValues>
                                <ns2:key>pgr</ns2:key>
                                <ns2:values>
                                    <ns2:key>sendRequest</ns2:key>
                                    <ns2:value>true</ns2:value>
                                </ns2:values>
                                <ns2:values>
                                    <ns2:key>returnRequest</ns2:key>
                                    <ns2:value>true</ns2:value>
                                </ns2:values>
                            </ns2:actionValues>
                            <ns2:branchCode>AUS </ns2:branchCode>
                            <ns2:sendToCustoms>false</ns2:sendToCustoms>
                            <ns2:sendSimplifiedEntry>false</ns2:sendSimplifiedEntry>
                            <ns2:sendCensusOverrides>false</ns2:sendCensusOverrides>
                            <ns2:returnAeRecs>true</ns2:returnAeRecs>
                            <ns2:dutyCalculation>C</ns2:dutyCalculation>
                            <ns2:feeCalculation>C</ns2:feeCalculation>

                            <ns2:formalEntryNo>0061965-4</ns2:formalEntryNo>
                            <ns2:legacyFileNo>0061965477</ns2:legacyFileNo>
                            <ns2:filerCode>231</ns2:filerCode>
                            <ns2:acsCatairRecordCount>52</ns2:acsCatairRecordCount>
                            <ns2:aceAdditionalDataRecordCount>23</ns2:aceAdditionalDataRecordCount>
                            <ns2:acsCatairRecords>++PRIORITY CAR</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>A3801231MCK00109021501                                     0061965-4 AUS5191</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>B013001231EI                              19                         MW</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>10A300191-10692480091-106924800                 8090415   231 0061965401098  WA</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>20                         40300109031500619654719          6934 090515X187</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>30                                  10              2090915             AA</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>40001XO00000050000000005000                    0000000001               INV001</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>50 4401100000          000000000000X                                CA090115N</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>OI        FUEL WOOD, IN LOGS,ETC</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG01001APHAPL</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG02P</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG10                   COMM DESC</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 TEST ELEMENT                                       000000400000KG   0500000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 EXAMPLE STUFF                                      000000600000M2   0300000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG06HRVCA</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 TEST ELEMENT                                       000000400000KG   0500000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 EXAMPLE STUFF                                      000000600000M2   0300000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG06HRVCO</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 TEST ELEMENT                                       000000400000KG   0500000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 EXAMPLE STUFF                                      000000600000M2   0300000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG06HRVOR</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 TEST ELEMENT                                       056866513284KG   0500564</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 EXAMPLE STUFF                                      000000600000M2   0300000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG06HRVWA</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG22             MF AP6 Y08242015</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG21CI QA TESTER              1237891111     TEST@EMAIL.COM</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG25                                                    000000005000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>OI        FUEL WOOD, IN LOGS,ETC</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG01002APHAPL</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG02P</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG10                   COMM DESC</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG04 TEST ELEMENT                                       000000400000KG   0500000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG05GENUS NAME            SPECIES NAME</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG06HRVCA</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG22             MF AP6 Y08242015</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG21CI QA TESTER              1237891111     TEST@EMAIL.COM</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG25                                                    000000005000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>PG141A1010                               108272015</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>60                                        XOALCFAB65RIC</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>62          49900001732</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>8949900000002500</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>90                        00000000000000000000000000000250000000005000</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>Y  3001231EI00020                                                    MW</ns2:acsCatairRecords>
                            <ns2:acsCatairRecords>Z3801231MCK00109021501                                     0061965-4 AUS5191</ns2:acsCatairRecords>
                            <ns2:aceAdditionalDataRecords>HDR2310061965-4</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>ACM      8 XX 01MW                                                                                                                                             WA            ACE IMPORT PRERELEASE *DO NOT MODIF</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AM21238 Test BLVD                     Test Suite A56                     Laredo                             TX78045       08242015 00000025000000002500             NNNNN006196547700005000CTNS 00050000KXOALCFAB65RIC  08242015ABI</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOVNEN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOODSN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOFSIN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMONHTN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOPSTN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOTS1N</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOAPHY</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOFDAN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOATFN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMODTCN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMOTTBN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AMONMFN</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>ACI001 0000100000000USD0000000050000000000000500000</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AI2                                                                      0000000000000000000000000000N</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>ACL00010001                                       0000000000  0000000000   0000000000000000000000000000000000000000000      7 000000000000000000000000000000000000000</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AL2</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AEVDXR08242015</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AEVCSD09022015</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>AEVESF09042015</ns2:aceAdditionalDataRecords>
                            <ns2:aceAdditionalDataRecords>TRL2310061965-4</ns2:aceAdditionalDataRecords>

                        </ns3:in>
                    </ns3:load7501FromCatair>
                </ns0:Body>
            </ns0:Envelope>
